In [31]:
import numpy as np
import pandas as pd

In [32]:
dict1 ={
    "name":['adish','rohan','thor','nik'],
    "class":['12','11','09','03'],
    "marks":['92','31','23','69']
}

In [33]:
df =  pd.DataFrame(dict1)

In [34]:
print(df)

    name class marks
0  adish    12    92
1  rohan    11    31
2   thor    09    23
3    nik    03    69

In [35]:
df.to_csv('try.csv')

In [36]:
pd.read_csv('try.csv')

   Unnamed: 0   name  class  marks
0           0  adish     12     92
1           1  rohan     11     31
2           2   thor      9     23
3           3    nik      3     69

In [37]:
pd.read_csv('stud.csv')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86